Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetLabel Method
 Gets the label of the user property. Labels are translated when translation is available.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetLabel()
Public Function GetLabel As String
Return Value
Type: String
The label of the user property.
See Also
Reference
UserPropertyItem Class
GetLabel Overload
Tekla.Structures.Catalogs Namespace